# -*- coding: utf-8 -*-
"""兴业银行网点 CIBORGANIZE  无经纬度"""
import re
from lxml.etree import HTML
from database._mongodb import MongoClient
from branch_scripts import GenericScript
from tools.web_api_of_baidu import get_lat_lng, get_area

"""
<table width="680" cellspacing="0" cellpadding="0" align="center">    
<tbody>        
<tr bgcolor="#d0e0ff">            
<td width="89" align="center"><strong>机具类型</strong></td>            
<td width="426" align="center"><strong>详细地址</strong></td>            
<td width="89" align="center"><strong>电话</strong></td>            
<td width="74" align="center"><strong>营业时间</strong></td>        
</tr>        

<tr>            <td>自动取款机</td>            <td>兰靛厂南路25号，车道沟桥西南角（西三环中路外行），大厦东北出口</td>            <td>010-88392487</td>            <td>24小时</td>        </tr>        <tr>            <td>自动取款机</td>            <td>扳井路（西四环北路内行），金源酒店不夜城门口</td>            <td>010-88392487</td>            <td>24小时</td>        </tr>        <tr>            <td>自动取款机</td>            <td>远大路（北三环西路外行，长春桥西行），金源购物中心，E9 一层</td>            <td>010-88392487</td>            <td>10：00-21：00</td>        </tr>        <tr>            <td>自动取款机</td>            <td>远大路（北三环西路外行，长春桥西行），金源购物中心，E20五层</td>            <td>010-88392487</td>            <td>10：00-21：00</td>        </tr>        <tr>            <td>自动取款机</td>            <td>远大路（北三环西路外行，长春桥西行），金源购物中心，E7 一层</td>            <td>010-88392487</td>            <td>10：00-21：00</td>        </tr>        <tr>            <td>自动取款机</td>            <td>远大路（北三环西路外行，长春桥西行），金源购物中心，E11五层</td>            <td>010-88392487</td>            <td>10：00-21：00</td>        </tr>        <tr>            <td>自动取款机</td>            <td>中关村，科贸电子城，3楼，东北角</td>            <td>010-88392487</td>            <td>9：00-19：00</td>        </tr>        <tr>            <td>自动取款机</td>            <td>中关村，科贸电子城，2楼，咨询台旁</td>            <td>010-88392487</td>            <td>9：00-19：00</td>        </tr>        <tr>            <td>自动取款机</td>            <td>中关村，科贸电子城，4楼，4A010商户旁</td>            <td>010-88392487</td>            <td>9：00-19：00</td>        </tr>        <tr>            <td>自动取款机</td>            <td>中关村，科贸电子城，1楼，联通沃3G旁</td>            <td>010-88392487</td>            <td>9：00-19：00</td>        </tr>        <tr>            <td>自动取款机</td>            <td>中关村，科贸电子城，3楼，3A010商户旁</td>            <td>010-88392487</td>            <td>9：00-19：00</td>        </tr>        <tr>            <td>自动取款机</td>            <td>中关村，E世界，3层，A3551商户旁</td>            <td>010-88392487</td>            <td>9：00-19：00</td>        </tr>        <tr>            <td>自动取款机</td>            <td>中关村，E世界，4层，ATM间</td>            <td>010-88392487</td>            <td>9：00-19：00</td>        </tr>        <tr>            <td>自动取款机</td>            <td>中关村，E世界，2层，过道间</td>            <td>010-88392487</td>            <td>9：00-19：00</td>        </tr>        <tr>            <td>自动取款机</td>            <td>中关村大街29号，海淀医院，三楼，B超科旁</td>            <td>010-88392487</td>            <td>24小时</td>        </tr>        <tr>            <td>自动取款机</td>            <td>中关村大街29号，海淀医院，一楼，收费处旁</td>            <td>010-88392487</td>            <td>24小时</td>        </tr>        <tr>            <td>自动取款机</td>            <td>北四环西路,海淀桥北，硅谷电脑城写字楼，一层进口处</td>            <td>010-88392487</td>            <td>8：30-18：00</td>        </tr>        <tr>            <td>自动取款机</td>            <td>上地东北旺南路1号院（马连洼北路与厢黄旗东路路口东行，100米北行）</td>            <td>010-88392487</td>            <td>24小时</td>        </tr>        <tr>            <td>自动取款机</td>            <td>清河安宁庄西路9号，金泰富地大厦，一层大厅</td>            <td>010-88392487</td>            <td>9：00-17：00</td>        </tr>        <tr>            <td>自动取款机</td>            <td>东小口镇中东路400号(中滩村北一街，龙德广场对面)，东亚新华投资公司，一层</td>            <td>010-88392487</td>            <td>9：00-17：00</td>        </tr>        <tr>            <td>自动取款机</td>            <td>天通北苑地铁站对面（立汤路）</td>            <td>010-88392487</td>            <td>9：00-17：00</td>        </tr>        <tr>            <td>自动取款机</td>            <td>双泉堡甲66号（北沙滩）学生公寓（北四环健翔桥北行，北沙滩桥西北）</td>            <td>010-88392487</td>            <td>24小时</td>        </tr>        <tr>            <td>自动取款机</td>            <td>双泉堡甲66号（北沙滩）学生公寓后门学生食堂（北四环健翔桥北行，北沙滩桥西北）</td>            <td>010-88392487</td>            <td>24小时</td>        </tr>        <tr>            <td>自动取款机</td>            <td>清华东路5-8号，尧舜北沙滩建材城，东门（北四环健翔桥北行，北沙滩桥西北）</td>            <td>010-88392487</td>            <td>7：00-21：00</td>        </tr>        <tr>            <td>自动取款机</td>            <td>八达岭路,西万家灯火建材厅,北门一层（北四环健翔桥北行，路西辅路）</td>            <td>010-88392487</td>            <td>9：00-18：00</td>        </tr>        <tr>            <td>自动取款机</td>            <td>八达岭路,西万家灯火建材厅,东门一层（北四环健翔桥北行，路西辅路）</td>            <td>010-88392487</td>            <td>9：00-18：00</td>        </tr>        <tr>            <td>自动取款机</td>            <td>首都机场2号楼出发厅，10口与12口中间</td>            <td>010-88392487</td>            <td>24小时</td>        </tr>        <tr>            <td>自动取款机</td>            <td>首都机场2号楼到达厅，10口与12口中间</td>            <td>010-88392487</td>            <td>24小时</td>        </tr>        <tr>            <td>自动取款机</td>            <td>首都机场1号楼出发厅一层大厅</td>            <td>010-88392487</td>            <td>24小时</td>        </tr>        <tr>            <td>自动取款机</td>            <td>美林小镇会所门口24小时超市，杨林大道-林阴路</td>            <td>010-88392487</td>            <td>24小时</td>        </tr>        <tr>            <td>自动取款机</td>            <td>麦子店西路(三元东桥东行，天津路南行），女人街市场入口处，地下一层</td>            <td>010-88392487</td>            <td>10：00-18：00</td>        </tr>        <tr>            <td>自动取款机</td>            <td>北三环，联想东桥西北，蓝景丽家大钟寺建材城，东南门，一层进门</td>            <td>010-88392487</td>            <td>10：00-20：00</td>        </tr>        <tr>            <td>自动取款机</td>            <td>北三环，联想东桥西北，蓝景丽家大钟寺建材城，三层家装处</td>            <td>010-88392487</td>            <td>10：00-20：00</td>        </tr>        <tr>            <td>自动取款机</td>            <td>北三环，学知桥西南,罗庄南里宏嘉丽园3号楼，一层ATM间</td>            <td>010-88392487</td>            <td>24小时</td>        </tr>        <tr>            <td>自动取款机</td>            <td>安德路地兴居甲8号，东城地税所大厅</td>            <td>010-88392487</td>            <td>9：00-17：00</td>        </tr>        <tr>            <td>自动取款机</td>            <td>成府路35号华清嘉园8号楼底商， 北四环保福寺桥北行。</td>            <td>010-88392487</td>            <td>9：00-17：00</td>        </tr>        <tr>            <td>自动取款机</td>            <td>王府井大街2号，华侨大厦一楼，大厅</td>            <td>010-88392487</td>            <td>24小时</td>        </tr>        <tr>            <td>自动取款机</td>            <td>朝阳门外悠唐国际购物酒店与购物中心过道处</td>            <td>010-88392487</td>            <td>10：00-22：00</td>        </tr>        <tr>            <td>自动取款机</td>            <td>西单商场一层东口</td>            <td>010-88392487</td>            <td>9：30-21：00</td>        </tr>        <tr>            <td>自动取款机</td>            <td>西单商场一层后门</td>            <td>010-88392487</td>            <td>9：30-21：00</td>        </tr>        <tr>            <td>自动取款机</td>            <td>西单西绒线胡同（西单路口东南处）曙光男科医院2层</td>            <td>010-88392487</td>            <td>8：00-20：00</td>        </tr>        <tr>            <td>自动取款机</td>            <td>丰台南路鸿业兴园二区19楼，社区地下市场</td>            <td>010-88392487</td>            <td>7：00-19：00</td>        </tr>        <tr>            <td>自动取款机</td>            <td>三里河路19号，甘家口大厦11层</td>            <td>010-88392487</td>            <td>24小时</td>        </tr>        <tr>            <td>存取款一体机</td>            <td>三里河路19号，甘家口大厦11层</td>            <td>010-88392487</td>            <td>24小时</td>        </tr>        <tr>            <td>自动取款机</td>            <td>鲁谷大街53号，天大商城一层</td>            <td>010-88392487</td>            <td>10：00-20：00</td>        </tr>        <tr>            <td>自动取款机</td>            <td>阜城路40号（西三环外行，八里庄桥东南）,裕龙国际酒店裕龙温泉大厅</td>            <td>010-88392487</td>            <td>24小时</td>        </tr>        <tr>            <td>自动取款机</td>            <td>大羊坊路，十里河灯具城入口处</td>            <td>010-88392487</td>            <td>8：30-17：30</td>        </tr>        <tr>            <td>自动取款机</td>            <td>十里河弘燕路,山水文园收藏市场一层进门处</td>            <td>010-88392487</td>            <td>9：00-17：00</td>        </tr>        <tr>            <td>自动取款机</td>            <td>光明桥东，路北</td>            <td>010-88392487</td>            <td>24小时</td>        </tr>        <tr>            <td>自动取款机</td>            <td>东四环红领巾公园东门，后八里庄5号</td>            <td>010-88392487</td>            <td>24小时</td>        </tr>        <tr>            <td>自动取款机</td>            <td>大望路五洲女子医院一层休息区（广渠路与西大望路路口西南角）</td>            <td>010-88392487</td>            <td>9：30-19：00</td>        </tr>        <tr>            <td>自动取款机</td>            <td>四季青桥西南,欧尚服装市场3层，A037商户旁</td>            <td>010-88392487</td>            <td>8：00-22：00</td>        </tr>        <tr>            <td>自动取款机</td>            <td>西四环岳各庄桥西南</td>            <td>010-88392487</td>            <td>24小时</td>        </tr>        <tr>            <td>自动取款机</td>            <td>科技园星火路11号，蓝谷科技大厦一层大厅</td>            <td>010-88392487</td>            <td>24小时</td>        </tr>        <tr>            <td>自动取款机</td>            <td>时代花园南路17号，西五环晋元桥西南，八角东路，茂华大厦一层大厅</td>            <td>010-88392487</td>            <td>24小时</td>        </tr>        <tr>            <td>自动取款机</td>            <td>杨庄大街69号，世嘉尚品家具店，进门过道间</td>            <td>010-88392487</td>            <td>24小时</td>        </tr>        <tr>            <td>自动取款机</td>            <td>六里桥（西三环中路）东北角，国电兴业酒店大厅</td>            <td>010-88392487</td>            <td>24小时</td>        </tr>        <tr>            <td>自动取款机</td>            <td>丽泽桥（西三环中路）东北角，蓝景丽家丽泽店一层进门处</td>            <td>010-88392487</td>            <td>10:00-20：00</td>        </tr>        <tr>            <td>自动取款机</td>            <td>丰管路（西南三环丰益桥西行）46号，东风标致4S店内</td>            <td>010-88392487</td>            <td>8：30-17：30</td>        </tr>        <tr>            <td>自动取款机</td>            <td>丰管路（西南三环丰益桥西行）西国贸汽配城门口</td>            <td>010-88392487</td>            <td>24小时</td>        </tr>        <tr>            <td>自动取款机</td>            <td>丰管路（西南三环丰益桥西行）西国贸大酒店内</td>            <td>010-88392487</td>            <td>24小时</td>        </tr>        <tr>            <td>自动取款机</td>            <td>樊家村新时特购物广场一层进门处</td>            <td>010-88392487</td>            <td>9：00-17：00</td>        </tr>        <tr>            <td>自动取款机</td>            <td>西南三环玉泉营桥西南角，西门</td>            <td>010-88392487</td>            <td>9：30-18：00</td>        </tr>        <tr>            <td>自动取款机</td>            <td>西南三环玉泉营桥西南角，东门</td>            <td>010-88392487</td>            <td>9：30-18：00</td>        </tr>        <tr>            <td>自动取款机</td>            <td>永定路88号，北门进一层大厅</td>            <td>010-88392487</td>            <td>24小时</td>        </tr>        <tr>            <td>自动取款机</td>            <td>天和北路铁路货场物流大厦内，京开高速，天宫院收费站出南行，兆丰桥调头北行，大庄桥东行1500米，路北</td>            <td>010-88392487</td>            <td>9：00-17：00</td>        </tr>        <tr>            <td>自动取款机<br>            存取款一体机</td>            <td>北京市朝阳区安贞西里三区11号福建大厦一层</td>            <td>010-64450942</td>            <td>24小时</td>        </tr>        <tr>            <td>自动取款机<br>            存取款一体机</td>            <td>北京市昌平区龙水路26号</td>            <td>010-57700001</td>            <td>24小时</td>        </tr>        <tr>            <td>存取款一体机</td>            <td>北京市朝阳区朝外大街77号</td>            <td>010-65522236</td>            <td>24小时</td>        </tr>        <tr>            <td>自动取款机<br>            存取款一体机</td>            <td>北京市东城区珠市口东大街5号《光明日报》社一楼</td>            <td>010-67016186</td>            <td>24小时</td>        </tr>        <tr>            <td>存取款一体机</td>            <td>北京市大兴区黄村镇兴华中路9号</td>            <td>010-81297416</td>            <td>24小时</td>        </tr>        <tr>            <td>自动取款机<br>            存取款一体机</td>            <td>北京市东城区东单三条 8—2号</td>            <td>010-65212363</td>            <td>24小时</td>        </tr>        <tr>            <td>自动取款机<br>            存取款一体机</td>            <td>北京市东城区朝阳门北大街5号五矿广场B座写字楼一、二层</td>            <td>010-64088698</td>            <td>24小时</td>        </tr>        <tr>            <td>存取款一体机</td>            <td>北京市朝阳区东直门外大街23号东外外交大楼一层</td>            <td>010-64688172</td>            <td>24小时</td>        </tr>        <tr>            <td>自动取款机<br>            存取款一体机</td>            <td>北京市东城区建国门内大街28号民生金融中心A座1—2层</td>            <td>010-65980025</td>            <td>24小时</td>        </tr>        <tr>            <td>自动取款机<br>            存取款一体机</td>            <td>北京市丰台区方庄紫芳园三区五号楼</td>            <td>010-87660014</td>            <td>24小时</td>        </tr>        <tr>            <td>自动取款机<br>            存取款一体机</td>            <td>北京市海淀区三里河路19号</td>            <td>010-88392100</td>            <td>24小时</td>        </tr>        <tr>            <td>自动取款机<br>            存取款一体机</td>            <td>北京市朝阳区东三环中路25号住总大厦</td>            <td>010-65086082-8822</td>            <td>24小时</td>        </tr>        <tr>            <td>自动取款机<br>            存取款一体机</td>            <td>北京市西城区广安门内大街315号</td>            <td>010-63691593</td>            <td>24小时</td>        </tr>        <tr>            <td>存取款一体机</td>            <td>北京市海淀区中关村西区丹棱街3号</td>            <td>010-82607656</td>            <td>24小时</td>        </tr>        <tr>            <td>自动取款机<br>            存取款一体机</td>            <td>北京市海淀区花园东路19号中兴大厦配楼一层</td>            <td>010-82247100</td>            <td>24小时</td>        </tr>        <tr>            <td>自动取款机<br>            存取款一体机</td>            <td>北京市西城区新街口外大街冰窖口胡同8号院8号楼首层</td>            <td>010-82808762</td>            <td>24小时</td>        </tr>        <tr>            <td>自动取款机<br>            存取款一体机</td>            <td>北京市西城区金城坊街1号C106</td>            <td>010-66215577</td>            <td>24小时</td>        </tr>        <tr>            <td>自动取款机<br>            存取款一体机</td>            <td>北京市海淀区蓝靛厂东路2号院金源时代商务中心2号楼A座一层</td>            <td>010-88891401</td>            <td>24小时</td>        </tr>        <tr>            <td>自动取款机<br>            存取款一体机</td>            <td>北京市亦庄开发区荣京东街3号荣京丽都大厦一层</td>            <td>010-67871927</td>            <td>24小时</td>        </tr>        <tr>            <td>存取款一体机</td>            <td>北京市西城区马连道中新佳园二区商业楼</td>            <td>010-59560751</td>            <td>24小时</td>        </tr>        <tr>            <td>存取款一体机</td>            <td>北京市朝阳区霄云路21号</td>            <td>010-84540867</td>            <td>24小时</td>        </tr>        <tr>            <td>自动取款机<br>            存取款一体机</td>            <td>北京市海淀区农大南路1号院硅谷亮城2号楼B座</td>            <td>010-62960285</td>            <td>24小时</td>        </tr>        <tr>            <td>自动取款机<br>            存取款一体机</td>            <td>北京市石景山区八角东街25号院丽贝亚大厦一层</td>            <td>010-56350093</td>            <td>24小时</td>        </tr>        <tr>            <td>自动取款机<br>            存取款一体机</td>            <td>北京市石景山区玉泉西里二区一号楼</td>            <td>010-68638655</td>            <td>24小时</td>        </tr>        <tr>            <td>存取款一体机</td>            <td>北京市海淀区复兴路甲1号</td>            <td>010-68526303</td>            <td>24小时</td>        </tr>        <tr>            <td>自动取款机<br>            存取款一体机</td>            <td>北京市海淀区首体南路9号主语商务中心2号楼</td>            <td>010-68790767</td>            <td>24小时</td>        </tr>        <tr>            <td>自动取款机<br>            存取款一体机</td>            <td>北京市顺义区天竺地区小天竺路1号埃力生商厦甲2号首层</td>            <td>010-64588538</td>            <td>24小时</td>        </tr>        <tr>            <td>自动取款机<br>            存取款一体机</td>            <td> 北京市顺义区府前东街甲2号大龙城乡建设开发公司首层</td>            <td>010-64582783</td>            <td>24小时</td>        </tr>        <tr>            <td>存取款一体机</td>            <td>北京市通州区玉带河东街2号院1号楼1层</td>            <td>010-80542062</td>            <td>24小时</td>        </tr>        <tr>            <td>自动取款机<br>            存取款一体机</td>            <td>北京市通州区车站路39号</td>            <td>010-60569988</td>            <td>24小时</td>        </tr>        <tr>            <td>自动取款机<br>            存取款一体机</td>            <td>北京市朝阳区望京阜荣街15号院3号楼首层</td>            <td>010-84763940</td>            <td>24小时</td>        </tr>        <tr>            <td>自动取款机<br>            存取款一体机</td>            <td>北京市海淀区中关村南大街韦伯时代大厦C座首层</td>            <td>010-88571570</td>            <td>24小时</td>        </tr>        <tr>            <td>自动取款机<br>            存取款一体机</td>            <td>北京市西城区宣内大街甲6号东南大厦一层北侧</td>            <td>010-66033087</td>            <td>24小时</td>        </tr>        <tr>            <td>自动取款机<br>            存取款一体机</td>            <td>北京市海淀区复兴路12号恩菲科技大厦一层</td>            <td>010-63959952</td>            <td>24小时</td>        </tr>        <tr>            <td>自动取款机</td>            <td>北京市海淀区西直门北大街42号节能大厦一层</td>            <td>010-62218689</td>            <td>24小时</td>        </tr>        <tr>            <td>自动取款机<br>            存取款一体机</td>            <td>北京市朝阳区亚运村安慧里四区16楼</td>            <td>010-84885263</td>            <td>24小时</td>        </tr>        <tr>            <td>自动取款机<br>            存取款一体机</td>            <td>北京市东城区永定门外大街101号百荣世贸二期南门</td>            <td>010-87804898</td>            <td>24小时</td>        </tr>        <tr>            <td>自动取款机<br>            存取款一体机</td>            <td>北京市西城区车公庄大街 9号五栋大楼A－03</td>            <td>010-88395803</td>            <td>24小时</td>        </tr>        <tr>            <td>自动取款机<br>            存取款一体机</td>            <td>北京市海淀区复兴路65号</td>            <td>010-68220101-307</td>            <td>24小时</td>        </tr>        <tr>            <td>自动取款机<br>            存取款一体机</td>            <td>北京市海淀区知春路59号中关村海关大厦一层</td>            <td>010-62615405</td>            <td>24小时</td>        </tr>        <tr>            <td>存取款一体机</td>            <td>北京市海淀区中关村南大街32号</td>            <td>010-62140582</td>            <td>24小时</td>        </tr>        <tr>            <td>自动取款机<br>            存取款一体机</td>            <td>北京市东城区鼓楼外大街26号</td>            <td>010-84131535</td>            <td>24小时</td>        </tr>        <tr>            <td>自动取款机<br>            存取款一体机<br>            存取款一体机</td>            <td>北京市石景山区政达路6号院2号楼</td>            <td>010-57796816</td>            <td>24小时</td>        </tr>        
<tr>            
<td>存取款一体机<br>            存取款一体机</td>            
<td>北京市西城区西直门南大街6号北京国二招宾馆东门底商</td>            
<td></td>            
<td>24小时</td>        
</tr>    
</tbody></table>"""


# <tbody>
# <tr bgcolor="#d0e0ff">
# <td width="63" align="center"><strong>网点名称 </strong></td>
# <td width="174" align="center"><strong>地址 </strong></td>
# <td width="162" align="center"><strong>联系电话 </strong></td>
# <td width="279" align="center"><strong>营业时间</strong></td>
# </tr>
# <tr>
# <td>南京分行</td>
# <td><a href="/NanJing/images/Outlet-njfh.gif">江苏省南京市玄武区长江路2号 </a></td>
# <td>对公：025-83193375<br>            对私：025-83193666-256102</td>
# <td>对私： 9:00-17:00 （周一至周六）<br>            对公： 9:00-12:00；13:30-17:00 （周一至周五）</td>
# </tr>
# <tr>
#     <td>南京鼓楼支行</td>
#     <td><a href="/NanJing/images/Outlet-gulou.gif">江苏省南京市鼓楼区湖北路1号 </a></td>
#     <td>对私：025-83243037<br>            对公：025-83243978</td>
#     <td>对私： 9:00-17:00 （周一至周六）<br>            对公：9:00-12:00；13:30-17:00（周一至周五）  
#     </td>
# </tr>        <tr>            <td>南京洪武支行</td>            <td><a href="/NanJing/images/Outlet-hongwu.gif">江苏省南京市秦淮区龙蟠中路223号</a></td>            <td>对私：025-84683310<br>            对公：025-84471623</td>            <td>对私： 9:00-17:00 （周日至周五）<br>            对公： 9:00-12:00；13:30-17:00（周一至周五）  </td>        </tr>        <tr>            <td>南京城北支行</td>            <td><a href="/NanJing/images/Outlet-chengbei.gif">江苏省南京市鼓楼区水佐岗64号金建大厦（模范中路南侧 </a></td>            <td>对私：025-83345339<br>            对公：025-83464978</td>            <td>对私： 9:00-17:00 （周日至周五）<br>            对公： 9:00-12:00；13:30-17:00（周一至周五）  </td>        </tr>        <tr>            <td>南京城东支行</td>            <td><a href="/NanJing/images/Outlet-chengdong.gif">江苏省南京市秦淮区大光路39号光华大厦一层</a></td>            <td>对公：025-84491883<br>            对私/大堂：025-84491883/025-84610807<br>            理财：025-84610807（周一至周六：09：00 -12:00;13:30-17：00）</td>            <td>对公：周一至周五，9：00-12：00，13：30-17：00<br>            对私：上午9：00-17：00（周一至周六）<br>            理财：上午9：00-17：00（周一至周六）</td>        </tr>        <tr>            <td>南京中央路支行</td>            <td><a href="/NanJing/images/Outlet-zhongyang.gif">江苏省南京市玄武区中央路258号 </a></td>            <td>83113060 83113076</td>            <td>对私： 9：00-17：00（周日至周五）<br>            对公： 9:00-12:00；13:30-17:00 （周一至周五）  </td>        </tr>        <tr>            <td>南京北京东路支行</td>            <td><a href="/NanJing/images/Outlet-beijingdonglu.jpg">江苏省南京市玄武区北京东路42-1号</a></td>            <td>对私：025-83376765<br>            对公：025-83329062</td>            <td>对私： 9:00-17:00 （周一至周六）<br>            对公： 9:00-12:00；13:30-17:00（周一至周五） </td>        </tr>        <tr>            <td>南京北京西路支行</td>            <td><a href="/NanJing/images/Outlet-beijingxilu.gif">江苏省南京市鼓楼区北京西路43-3号 </a></td>            <td>025-83751362、83751361</td>            <td>对私： 9:00-17:00 （周一至周六）<br>            对公：9:00-12:00；13:30-17:00（周一至周五）  </td>        </tr>        <tr>            <td>南京城南支行</td>            <td><a href="/NanJing/images/Outlet-chengnan.gif">江苏省南京市秦淮区中山南路414号 </a></td>            <td>52389575 52389587</td>            <td>对私： 9:00-17:00 （周一至周六）<br>            对公： 9:00-12:00；13:30-17:00 （周一至周五）  </td>        </tr>        <tr>            <td>南京江宁支行</td>            <td><a target="_blank" href="/NanJing/images/Outlet-jiangning.jpg">江苏省南京市江宁区胜太路8号（汇金旗林大厦） </a></td>            <td>52109860 52127061</td>            <td>对私： 9:00-17:00 （周日至周五）<br>            对公： 9:00-12:00；13:30-17:00（周一至周五）  </td>        </tr>        <tr>            <td>南京河西支行</td>            <td><a target="_blank" href="/NanJing/images/Outlet-hexi.jpg">江苏省南京市建邺区江东中路1号</a></td>            <td>87790300 87790302</td>            <td>对私： 9:00-17:00（周日至周五）<br>            对公： 9:00-12:00；13:30-17:00（周一至周五）  </td>        </tr>        <tr>            <td>南京苜蓿园支行</td>            <td><a target="_blank" href="/NanJing/images/Outlet-ms.GIF">江苏省南京市泰淮区苜蓿园大街46号</a></td>            <td>84862217 84861695</td>            <td>对私：9:00-17:00（周日至周五）<br>            对公：9:00-12:00；13:30-17:00（周一至周五）  </td>        </tr>        <tr>            <td>南京红山路支行</td>            <td><a target="_blank" href="/NanJing/images/Outlet-njmgq2.gif">江苏省南京市玄武区红山路192号</a></td>            <td>对私：025-52422795<br>            对公：025-52417592</td>            <td>对私：上午9：00-17：00（周一至周六）<br>            对公：上午9：00-12：00； 下午13：30-17：00（周一至周五）</td>        </tr>        <tr>            <td>南京六合支行</td>            <td><a target="_blank" href="/NanJing/images/Outlet-njlh.doc">江苏省南京市六合区葛关路380-1号</a></td>            <td>对私：025-57016115 <br>            对公：025-57016203</td>            <td>对私：上午9：00-17：00（周一至周六）<br>            对公：上午9：00-12：00；下午13：30-17：00（周一至周五）</td>        </tr>        <tr>            <td>南京浦口支行</td>            <td><a target="_blank" href="/NanJing/images/Outlet-njpk.jpg">南京市浦口区新浦路120号</a></td>            <td>对公：025-58186296<br>            对私/大堂：025-58186227<br>            理财：025-58186227</td>            <td>对公：周一至周五，9：00-12：00，13：30-17：00<br>            对私：周一至周五，9：00-17：00，周日，9：00-17：00<br>            理财：周一至周五，9：00-17：00，周日，9：00-17：00</td>        </tr>        <tr>            <td>南京溧水支行</td>            <td><a href="/NanJing/images/Outlet-ls.jpg">江苏省南京市溧水区永阳街道珍珠南路99号广成东方名城110幢103室</a></td>            <td>对私：025-51805695<br>            对公：025-51805691</td>            <td>对私：9：00-17:00<br>            （周一至周六）<br>            对公：9：00-12：00；13：30-17：00<br>            （周一至周五） </td>        </tr>        <tr>            <td>无锡分行</td>            <td><a href="/NanJing/images/Outlet-wuxi.gif">江苏省无锡市滨湖区太湖新城金融一街10号</a></td>            <td>对私：0510-82695561<br>            对公：0510-82713262</td>            <td>对私：上午8：30-17：00（周一至周五） <br>            对公：上午8：30-11：30；下午13：30-17：00（周一至周五）  </td>        </tr>        <tr>            <td>无锡城南支行</td>            <td><a href="/NanJing/images/Outlet-wuxichengnan.gif">江苏省无锡市南长区永乐路371号</a></td>            <td>对公：0510-85010621<br>            对私：0510-85010631</td>            <td>对私： 8:30-17:00 （周日至周五）<br>            对公： 8:30-11:30；13:30-17:00（周一至周五）  </td>        </tr>        <tr>            <td>无锡滨湖支行</td>            <td style="color: rgb(51,102,255)"><a href="/NanJing/images/Outlet-binghu.JPG"><span style="color: rgb(0,0,255)">江苏省无锡市滨湖区梁溪路703号</span></a></td>            <td>对私：0510-85807382</td>            <td>对私：8：30-17:00（周日至周五）<br>            对公：上午8：30-11：30； 下午13：30-17：00（周一至周五）</td>        </tr>        <tr>            <td>无锡锡山支行</td>            <td><a href="/NanJing/images/Outlet-xishan.gif">江苏省无锡市锡山区华夏南路11号 </a></td>            <td>对公：0510-88210037<br>            对私：0510-88205004</td>            <td>对私： 8:30-17:00 （周一至周六）<br>            对公： 8:30-11:30；13:30-17:00（周一至周五）  </td>        </tr>        <tr>            <td>无锡新吴支行</td>            <td><a href="/NanJing/images/Outlet-wuxi.JPG">江苏省无锡市新吴区长江北路162号</a></td>            <td>对私：0510-82136235</td>            <td>对私：8：30-17:00（周日至周五）<br>            对公：上午8：30-11：30； 下午13：30-17：00（周一至周五）</td>        </tr>        <tr>            <td>惠山支行</td>            <td><a href="/NanJing/images/Outlet-huishan.gif">江苏省无锡市惠山区政和大道299号</a></td>            <td>对私：0510-83590106<br>            对公：0510-83596396</td>            <td>对私： 上午8：30-17：00 （周一至周六）<br>            对公： 8:30-11:30；13:30-17:00（周一至周五）  </td>        </tr>        <tr>            <td>无锡城中支行</td>            <td><a href="/NanJing/images/Outlet-chengzhong.gif">江苏省无锡市崇安区县前西街99号</a></td>            <td>对私：0510-82795561<br>            对公：0510-82713357</td>            <td>对私：上午8：30-17：00 （周一至周六） <br>            对公：上午8：30-11：30；下午13：30-17：00（周一至周五）  </td>        </tr>        <tr>            <td>宜兴支行</td>            <td><a href="/NanJing/images/Outlet-yixing.gif">江苏省宜兴市宜北路82号新天地广场</a></td>            <td>对私：0510-89795561 <br>            对公：0510-87338993</td>            <td>对私： 8:00-16:30 （周日至周五）<br>            对公： 8:00-11:30；13:30-16:30 （周一至周五）  </td>        </tr>        <tr>            <td>江阴支行</td>            <td><a href="/NanJing/images/Outlet-jiangyin.GIF">江苏省江阴市人民东路301号</a></td>            <td>对公：0510－86070227<br>            对私：0510－86070229</td>            <td>对私： 8:30-16:30 （周一至周六）<br>            对公： 8:30-11:30；13:30-17:00 （周一至周五）  </td>        </tr>        <tr>            <td>兴业银行常州分行</td>            <td><a href="/NanJing/images/Outlet-changzhou.jpg">江苏省常州市新北区惠国路69号山水和园4幢</a></td>            <td>对私：0519-81983061               <br>            对公：0519-86878127</td>            <td>对私：上午8：30-17：00（周一至周日）<br>            对公：上午8：30-11：30；下午13：30-17：00（周一至周五）</td>        </tr>        <tr>            <td>常州溧阳支行</td>            <td><a href="/NanJing/images/Outlet-changzhouliyang.jpg">常州溧阳市溧城区南大街189号</a></td>            <td>对公：0519-80995000<br>            对私：0519-80995016</td>            <td>对私：上午8：30-11：30；下午13：30-17：00（周一至周五）<br>            上午8：30-11：30；下午13：30-16：30（周六）<br>            对公：上午8：30-11：30；下午13：30-17：00（周一至周五）</td>        </tr>        <tr>            <td>常州武进支行</td>            <td><a href="/NanJing/images/Outlet-wj.jpg">江苏省常州市武进区湖塘镇花园街新城南都158-1幢</a></td>            <td>对私：0519-89803390 <br>            对公：0519-89803252</td>            <td>对私：上午8：30-11：30;下午13：30-17:00（周一至周六）<br>            对公：上午8：30-11：30；下午13：30-17：00（周一至周五）</td>        </tr>        <tr>            <td>常州新北支行</td>            <td><a href="/NanJing/images/Outlet-czxinbei.jpg">常州市新北区汉江路372号</a></td>            <td>对私：0519-81161899<br>            对公：0519-81161881</td>            <td>对私：上午8：30-16：30（周一至周六）<br>            对公：上午8：30-11：30；下午13：30-16：30（周一至周五）</td>        </tr>        <tr>            <td>常州天宁支行</td>            <td><a href="/NanJing/images/Outlet-cztianning.jpg">江苏省常州市飞龙东路66号红梅大厦一楼</a></td>            <td>对私：0519-80583588<br>            对公：0519-80583591</td>            <td>对私：上午8：30-17：00 （周一至周六） <br>            对公：上午8：30-11：30；下午13：30-17：00（周一至周五）</td>        </tr>        <tr>            <td>金坛支行</td>            <td><a href="/NanJing/images/Outlet-20131119.bmp">江苏省金坛市东门大街233号</a></td>            <td>电话：0519-82689955</td>            <td>对私：上午8：30-11：30；下午13：00-17：00（周一至周六）<br>            对公：上午8：30-11：30；下午13：30-17：00（周一至周五）</td>        </tr>        <tr>            <td>常州钟楼支行</td>            <td><a href="/NanJing/images/Outlet-20180224.jpg">江苏省常州市钟楼区河景花园61-62号</a></td>            <td>对私：0519-86878121<br>            对公：0519-86878123</td>            <td>对私：8：30-17:00（周一至周六） <br>            对公：上午8：30-11：30； 下午13：30-17：00（周一至周五）</td>        </tr>        <tr>            <td>南通分行</td>            <td><a href="/NanJing/images/Outlet-nantong.GIF" target="_blank">江苏省南通市崇川区世纪大道18号兴业大厦</a></td>            <td>对私：0513-89098111<br>            对公：0513-89098350  </td>            <td>对私：上午8：30-11：30；下午13：30－17：00（周一至周六）<br>            对公：上午8：30-11：30；下午13：30-17：00（周一至周五）</td>        </tr>        <tr>            <td>海门支行</td>            <td><a href="/NanJing/images/Outlet-haimen.GIF" target="_blank">江苏省海门市长江路538号万众新世界广场B楼</a></td>            <td>对私：0513-81239999<br>            对公：0513-81262826</td>            <td> 对私：上午8：30-12：00；下午13：30-17:00 （周一至周六）<br>            对公：上午8：30-11：30；下午13:30-17:00 （周一至周五） </td>        </tr>        <tr>            <td>南通通州支行</td>            <td><a href="/NanJing/images/Outlet-tongzhou.gif" target="_blank">江苏省南通市通州区金沙镇新金西路34号</a></td>            <td>对私：0513-86309999<br>            对公：0513-86125977</td>            <td>对私：上午8：30-12：00；下午13：30-17:00 （周一至周六）<br>            对公： 上午8：30-11：30；下午13：30-17：00 （周一至周五）</td>        </tr>        <tr>            <td>南通开发区支行</td>            <td><a href="/NanJing/images/Outlet-kaifaqu.jpg" target="_blank">江苏省南通经济技术开发区上海东路炜赋•星湖邻里2号108号 </a></td>            <td>对私：0513-89192555<br>            对公：0513-89192581</td>            <td>对私：上午8：30—16：30（周一至周五）<br>            对公：上午8：30-11：30；下午13：30-16：30 （周一至周五）</td>        </tr>        <tr>            <td>海安支行</td>            <td><a href="http://www.cib.com.cn/netbank/cn/Branch/NanJing/download/20130115.ppt" target="_blank">江苏省海安市海安镇中坝南路9号北侧附楼</a></td>            <td>对私：0513-81852228<br>            对公：0513-81852216</td>            <td>对私：上午8：30-12：00；下午13：30-17：00（周一至周六）<br>            对公：上午8：30-11：30；下午13：30-17：00（周一至周五）</td>        </tr>        <tr>            <td>南通城中支行</td>            <td><a href="/NanJing/images/Outlet-chengzhong.jpg" target="_blank">江苏省南通市崇川区环城西路16号飞马大厦</a></td>            <td>对私：0513-68936679<br>            对公：0513-68936686</td>            <td>对私：9：00-17：00（周一至周五）<br>            上午9：00-11：30；下午：13：30-16：00（周日）<br>            对公：上午9:00-11:30；下午13：30-17：00（周一至周五）</td>        </tr>        <tr>            <td>启东支行</td>            <td><a href="/NanJing/images/Outlet-qidong.jpg" target="_blank">江苏省启东市汇龙镇人民中路869号</a></td>            <td>对私：0513-83655555<br>            对公：0513-83839677</td>            <td>对私：    8：30-17：00 （周一至周六） <br>            对公：上午8：30-11:30；下午13：30-17：00（周一至周五）</td>        </tr>        <tr>            <td>南通城东支行</td>            <td><a href="/NanJing/images/Outlet-nantong.jpg">江苏省南通市崇川区工农路253号</a></td>            <td>0513－89097555</td>            <td>周一至周五：8：30-17:00<br>            周六:上午8：30-11：30；       下午13：30-17：00<br>            周日休息</td>        </tr>        <tr>            <td>如皋支行</td>            <td><a href="/NanJing/images/Outlet-rubu0301.jpg" target="_blank">江苏省如皋市如城街道健康路1号紫竹园321幢</a></td>            <td>对私：0513－81710666<br>            对公：0513－81710667</td>            <td>对私：上午8：30-11：30；下午13：00-17：00 （周一至周六）<br>            对公：上午8：30-11：30；下午13：00-17：00 （周一至周五）</td>        </tr>        <tr>            <td>徐州分行</td>            <td><a href="/NanJing/images/Outlet-xuzhou.jpg">江苏省徐州市建国西路75号</a></td>            <td>对公：0516-85900999-258728 <br>            对私：0516-85900999-258915</td>            <td>对私： 9:00-16:50 （周一至周日）<br>            对公： 9:00-12:00；13:30-16:50 （周一至周五）  </td>        </tr>        <tr>            <td>徐州开发区支行</td>            <td><a href="/NanJing/images/Outlet-xzkfqzh.GIF">江苏省徐州市经济技术开发区徐海路南君廷湖畔小区商业1号楼1-（101-105）</a></td>            <td>对公：0516-83053316<br>            对私：0516-83053316</td>            <td>对公：9：00-12:00；13：30-16:00  （周一至周五）<br>            对私：9：00-16：00 （周一至周五）</td>        </tr>        <tr>            <td>徐州铜山支行</td>            <td><a target="_blank" href="/NanJing/images/Outlet-tongshan.jpg">徐州市铜山区北京北路11号</a></td>            <td>对私：0516-83535655<br>            对公：0516-83535655</td>            <td>对公：上午9：00-12：00；下午13：30-16：30（周一至周五）<br>            对私：上午9：00-16：30（周一至周六）</td>        </tr>        <tr>            <td>徐州城西支行</td>            <td><a target="_blank" href="/NanJing/images/Outlet-cx.jpg">江苏省徐州市淮海西路路388号</a></td>            <td>对公：0516-85551695<br>            对私：0516-85551695</td>            <td>对公：上午9：00-12：00；下午13：30-16：50（周一至周五）<br>            对私：上午9：00-下午16：50（周一至周六）</td>        </tr>        <tr>            <td>邳州支行</td>            <td><a target="_blank" href="/NanJing/images/Outlet-pz.jpg">江苏省邳州市运河镇解放路41号</a></td>            <td>对公：0516-86262862<br>            对私：0516-86262862</td>            <td>对公：上午9：00-12：00； 下午14：00-17：00（周一至周五） <br>            对私：9：00-17:00（周一至周日）</td>        </tr>        <tr>            <td>泰州分行</td>            <td><a href="/NanJing/images/Outlet-taizhou.GIF">江苏省泰州市海陵区凤凰东路88号（市政府西）</a></td>            <td>对公：0523-86195368 <br>            对私：0523-86195370</td>            <td>对公：上午8:30-12:00；下午13:30-17:30（周一至周五）<br>            对私：上午8:30-下午17:30（周一至周六,周日休息）</td>        </tr>        <tr>            <td>靖江支行</td>            <td><a href="/NanJing/images/Outlet-jingjiang.png">靖江市人民南路98号光芒大厦</a></td>            <td>对私：0523-81150009<br>            对公：0523-81150006</td>            <td>对私：上午8：30-17：30（周一至周六）<br>            对公：上午8：30-11：30；下午14：00-17：30（周一至周五）  </td>        </tr>        <tr>            <td>兴化支行</td>            <td><a href="/NanJing/images/Outlet-xinghua.bmp">江苏省兴化市长安南路121号</a></td>            <td>0523-80795561</td>            <td>对私：上午8：30-17：30（周一至周六）<br>            对公：上午8:30-12:00;下午14：00-17：30（周一至周五）</td>        </tr>        <tr>            <td>泰州南通路支行</td>            <td><a href="/NanJing/images/Outlet-nantonglu.gif">江苏省泰州市海陵区南通路998号</a></td>            <td>对公电话：0523-81550015<br>            对私电话：0523-81550015</td>            <td>对公：上午8:30-12:00，下午13:30-17:30（周一至周五）<br>            对私：上午8:30-下午17:30（周日至周五，周六休息）</td>        </tr>        <tr>            <td>泰兴支行</td>            <td><a href="/NanJing/images/Outlet-taixing.gif">江苏省泰兴市国庆东路12号</a></td>            <td>对私：0523-87295561<br>            对公：0523-87871010</td>            <td>对私：上午8：30-17：30 （周一至周六） <br>            对公：上午8：30-11:30；下午14:00-17：30（周一至周五）</td>        </tr>        <tr>            <td>扬州分行</td>            <td><a href="/NanJing/images/Outlet-yangzhou.gif">江苏省扬州市邗江区维扬路399</a></td>            <td>对公：0514-89710869<br>            对私：0514-89710868</td>            <td>对私： 8:30-17:00 （周一至周日）<br>            对公： 8:30-12:00；14:00-17:00 （周一至周五）</td>        </tr>        <tr>            <td>兴业银行扬州江都支行</td>            <td><a href="/NanJing/images/Outlet-yangzhoujiangdu.bmp">江苏省扬州市江都区龙川北路132号</a></td>            <td>对公：0514-89689563<br>            对私：0514-89689562</td>            <td>对私：上午8：30-17：00 （周一至周六） <br>            对公：上午8：30-12：00；下午14：00-17：00（周一至周五）</td>        </tr>        <tr>            <td>兴业银行扬州广陵支行</td>            <td><a href="/NanJing/images/Outlet-yangzhouguangling.png">江苏省扬州市广陵区观潮路996、996号</a></td>            <td>对公：0514-89710918<br>            对私：0514-89710916</td>            <td>对私：上午8：30-17：00（周一至周六） <br>            对公：上午8：30-12:00；下午14：00-17：00（周一至周五）</td>        </tr>        <tr>            <td>扬州城中支行</td>            <td><a href="/NanJing/images/Outlet-yangzhouchengzhong.png">江苏省扬州市文汇东路180号金马大厦1-104、1-202室</a></td>            <td>对私：0514-89710995<br>            对公：0514-89710993</td>            <td>对私：上午8：30-17：00 （周一至周六） <br>            对公：上午8：30-12:00；下午14：00-17：00（周一至周五）</td>        </tr>        <tr>            <td>镇江分行</td>            <td><a href="/NanJing/images/Outlet-zhenjiang.jpg">江苏省镇江市中山西路102号（老火车站斜对面）</a></td>            <td>对私：0511-89009900<br>            对公：0511-89009985</td>            <td>对私： 8:30-17:00 （周一至周日）<br>            对公： 8:30-12:00；13:30-17:00 （周一至周五） <br>            夏令时间(5月1日至9月30日)<br>            对私： 8：30-17:30（周一至周日） <br>            对公：上午8：30-12：00；下午 14：00-17：30（周一至周五）</td>        </tr>        <tr>            <td>丹阳支行</td>            <td><a target="_blank" href="/NanJing/images/Outlet-danyang.jpg">江苏省丹阳市新民西路279号（省丹中向西100米）</a></td>            <td>对私：0511-86999926<br>            对公：0511-86999921</td>            <td>对私（周一至周五：上午8：30-12:00;下午13:30-17:00;） <br>            （周六：上午9：00-12:00;下午13:30-16:00;周日休业） <br>            对公：（周一至周五：上午8：30-11：30；下午 13：30-17：00） <br>            夏令时间(5月1日至9月30日)<br>            对私（周一至周五：上午8：30-12:00;下午14:00-17:30;） <br>            （周六：上午9：00-12:00;下午14:00-16:30;周日休业） <br>            对公（周一至周五：上午8：30-11：30；下午 14：00-17：30）</td>        </tr>        <tr>            <td>扬中支行</td>            <td>扬中市春柳北路215号（长江花城五期6幢）</td>            <td>对私：0511-88589268<br>            对公：0511-88589283</td>            <td>对私（周一至周六：上午8：30-12:00;下午13:30-17:00，周日休业） <br>            对公（周一至周五：上午8：30-12：00；下午 13：30-17：00） <br>            夏令时间(5月1日至9月30日)<br>            对私（周一至周六：上午8：30-12:00;下午14:00-17:30， 周日休业） <br>            对公（周一至周五：上午8：30-12：00；下午 14：00-17：30）</td>        </tr>        <tr>            <td>盐城分行</td>            <td><a target="_blank" href="/NanJing/images/Outlet-yancheng.jpg">江苏省盐城市世纪大道603号</a></td>            <td>对私：0515-89088929<br>            对公：0515-89088925</td>            <td>对私：上午8：30-17：00 （周一至周日）<br>            对公：上午8：30-12：00；下午14：00-17：00（周一至周五）</td>        </tr>        <tr>            <td>盐城大丰支行</td>            <td><a target="_blank" href="/NanJing/images/Outlet-ycdf.jpg">江苏省盐城市大丰区金丰南路99号</a></td>            <td>对私：0515-83295561<br>            对公：0515-83295023</td>            <td>对私：上午8:30-12:00; 下午14:00-17:30，（周一至周五）<br>            对公：上午：8：30--12：00，下午：14：00--17：30，（周一至周五）</td>        </tr>        <tr>            <td>盐城开发区支行</td>            <td><a target="_blank" href="/NanJing/images/Outlet-yckfq.jpg">盐城市开发区新都路北侧泰山路西侧未来科技城C2幢一楼</a></td>            <td>对私：0515-89088997<br>            对公：0515-89088979</td>            <td>对私：上午8:30-12:00; 下午14:00-17:30（周一至周五）<br>            对公：上午8:30-12:00; 下午14:00-17:30（周一至周五）</td>        </tr>        <tr>            <td>淮安分行</td>            <td><a target="_blank" href="/NanJing/images/Outlet-huaian.jpg">江苏省淮安市淮海东路18号</a></td>            <td>对私：0517-89000022<br>            对公：0517-89000028</td>            <td>对私：上午8：30-17：00（周一至周日）<br>            对公：上午8：30-11：30；下午13：30-17:00（周一至周五）</td>        </tr>        <tr>            <td>淮安淮阴支行</td>            <td><a target="_blank" href="/NanJing/images/Outlet-huaian_huaiyin.jpg">江苏省淮安市淮阴区长江东路36号中熙凤凰城小区2号商业楼115室</a></td>            <td>对私：0517-81567719<br>            对公：0517-81567559</td>            <td>对私：8：30-17:00（周一至周日）<br>            对公：上午8：30-11：30； 下午13：30-17：00（周一至周五）</td>        </tr>        <tr>            <td>连云港分行</td>            <td><a href="/NanJing/images/Outlet-lianyungan.jpg">江苏省连云港市海州区通灌南路104号</a></td>            <td>对私：0518-81882605<br>            对公：0518-81882603</td>            <td>对私：8：30-17:00       （周一至周日）<br>            对公：上午8：30-12：00； 下午14：00-17：00       （周一至周五）</td>        </tr>        <tr>            <td>宿迁分行</td>            <td><a href="/NanJing/images/Outlet-sq.jpg">江苏省宿迁市洪泽湖路1588号金鹏国际广场</a></td>            <td>对私：0527-81268808<br>            对公：0527-81268818</td>            <td>对私：8：30-17:00       （周一至周日）<br>            对公：上午8：30-12：00； 下午14：00-17：00       （周一至周五）</td>        </tr>        <tr>            <td>泰州姜堰支行</td>            <td><a href="/NanJing/images/Outlet-jiangyan.jpg">江苏省泰州市姜堰区东方不夜城16号113、114、115、116室</a></td>            <td>0523-81553308</td>            <td>对私：8：30-17:30       （周一至周六）<br>            对公：上午8：30-12：00； 下午13：30-17：30       （周一至周五）</td>        </tr>    </tbody></table>


def data_shuffle(data, province_list, city_list, area_list):
    for city in city_list:
        if city["NAME_"] == "县":
            city_list.remove(city)

    data_list = list()
    # 地区信息预处理
    prov_n = ""
    prov_c = ""
    city_n = ""
    city_c = ""
    # 省市级信息
    if "北京" in data["CITY_NAME_"]:
        prov_n = "北京市"
        prov_c = "1100"
        city_n = "北京市"
        city_c = "110100"
    elif "天津" in data["CITY_NAME_"]:
        prov_n = "天津市"
        prov_c = "1200"
        city_n = "天津市"
        city_c = "120100"
    elif "上海" in data["CITY_NAME_"]:
        prov_n = "上海市"
        prov_c = "3100"
        city_n = "上海市"
        city_c = "310100"
    elif "重庆" in data["CITY_NAME_"]:
        prov_n = "重庆市"
        prov_c = "5000"
        city_n = "重庆市"
        city_c = "500100"
    else:
        for city in city_list:
            if city["NAME_"][:-1] in data["CITY_NAME_"]:
                city_n = city["NAME_"]
                city_c = city["CODE_"]
                prov_c = city["PARENT_"]
                break
        if prov_c:
            for prov in province_list:
                if prov["CODE_"] == prov_c:
                    prov_n = prov["NAME_"]
                    break

    t_html = HTML(data["HTML_"])
    title_index = 0
    t_tr = t_html.xpath("//tr")
    # print(data["URL_"])
    len_title = t_tr[0].xpath(".//td")
    if len(len_title) == 1:
        len_title = t_tr[1].xpath(".//td")
        title_index = 1
        if len(len_title) == 1:
            len_title = t_tr[2].xpath(".//td")
            title_index = 2
    title_list = list()
    for title in len_title:
        title_each = title.xpath(".//strong//text()")
        if not title_each:
            title_each = title.xpath(".//text()")
        title_list.append(title_each[0])
    # print(title_list)

    name_index = None
    addr_index = None
    tel_index = None
    time_index = None
    if "广州" in title_list:
        title_list.remove("广州")
    for index, value in enumerate(title_list):
        # 网点名称/支行名称/社区支行/ATM名称  /所属网点 + 机具类型/ 无 地址 + （机具类型（存取款一体机/自动取款机/单存机（/VTM）））
        if "名称" in value or "社区支行" in value:
            name_index = index
        elif "电话" in value or "热线" in value:
            tel_index = index
        elif "时间" in value:
            time_index = index
        elif "地址" in value:
            addr_index = index
    for e in range(title_index+1, len(t_tr)):
        re_data = dict()
        each_value = t_tr[e].xpath(".//td//text()")
        # print(title_list)
        # print(each_value)
        if len(each_value) < len(title_list):
            continue
        else:
            # try:
            if isinstance(addr_index, int):
                # print(addr_index)
                addr = each_value[addr_index].replace(" ", "")
                if "自动取款机" in addr or "存取款一体机" in addr:
                    try:
                        addr = each_value[addr_index+1].replace(" ", "")
                    except IndexError:
                        addr = each_value[addr_index].replace(" ", "")
            else:
                addr = ""
            if isinstance(tel_index, int):
                # print(tel_index)
                tel = each_value[tel_index].replace(" ", "")
                try:
                    if "自动取款机" in tel or "存取款一体机" in tel:
                        tel = each_value[tel_index + 1].replace(" ", "")
                except IndexError:
                    tel = each_value[tel_index].replace(" ", "")
            else:
                tel = ""
            if isinstance(time_index, int):
                # print(time_index)
                time = each_value[time_index].replace(" ", "")
                if "自动取款机" in time or "存取款一体机" in time:
                    try:
                        time = each_value[time_index + 1].replace(" ", "")
                    except IndexError:
                        time = each_value[time_index].replace(" ", "")
            else:
                time = ""
            if isinstance(name_index, int):
                # print(name_index)
                name = each_value[name_index].replace(" ", "")
            else:
                name = addr + "自助银行"
            # except IndexError as e:
            #     continue

        # print(name)
        # print(addr)
        # print(tel)
        # print(time)

        # 地址清洗
        if prov_n in addr:
            pass
        elif prov_n[:-1] in addr[:len(prov_n)]:
            addr = addr[:len(prov_n)].replace(prov_n[:-1], prov_n) + addr[len(prov_n):]
        elif prov_n[:4] in addr[:len(prov_n)]:
            addr = addr[:len(prov_n)].replace(prov_n[:4], prov_n) + addr[len(prov_n):]
        elif prov_n[:3] in addr[:len(prov_n)]:
            addr = addr[:len(prov_n)].replace(prov_n[:3], prov_n) + addr[len(prov_n):]
        elif prov_n[:2] in addr[:len(prov_n)]:
            addr = addr[:len(prov_n)].replace(prov_n[:2], prov_n) + addr[len(prov_n):]
        else:
            addr = prov_n + addr

        if city_n in addr[:len(prov_n) + len(city_n)]:
            addr = addr
        elif city_n[:-1] in addr[:len(prov_n) + len(city_n)]:
            addr = addr[:len(prov_n) + len(city_n)].replace(
                city_n[:-1], city_n) + addr[len(prov_n) + len(city_n):]
        elif city_n[:4] in addr[:len(prov_n) + len(city_n)]:
            addr = addr[:len(prov_n) + len(city_n)].replace(
                city_n[:4], city_n) + addr[len(prov_n) + len(city_n):]
        elif city_n[:3] in addr[:len(prov_n) + len(city_n)]:
            addr = addr[:len(prov_n) + len(city_n)].replace(
                city_n[:3], city_n) + addr[len(prov_n) + len(city_n):]
        elif city_n[:2] in addr[:len(prov_n) + len(city_n)]:
            addr = addr[:len(prov_n) + len(city_n)].replace(
                city_n[:2], city_n) + addr[len(prov_n) + len(city_n):]
        else:
            addr = addr[:len(prov_n)] + city_n + addr[len(prov_n):]

        result = get_lat_lng(address=addr)
        try:
            re_data["LAT_"] = str(result["result"]["location"]["lat"])
            re_data["LNG_"] = str(result["result"]["location"]["lng"])
        except KeyError:
            re_data["LAT_"] = ""
            re_data["LNG_"] = ""
        else:
            dis_result = get_area(",".join([re_data["LAT_"], re_data["LNG_"]]))
            try:
                re_data["AREA_NAME_"] = dis_result["result"]["addressComponent"]["district"]
            except KeyError:
                re_data["AREA_NAME_"] = ""
            try:
                re_data["AREA_CODE_"] = dis_result["result"]["addressComponent"]["adcode"]
            except KeyError:
                re_data["AREA_CODE_"] = ""
        # "C"
        re_data["BANK_CODE_"] = "CIB"
        re_data["BANK_NAME_"] = data["ENTITY_NAME_"][:-3]
        re_data["SPIDER_TIME_"] = data["DATETIME_"]
        # re_data["AREA_CODE_"] = area_c
        # re_data["AREA_NAME_"] = area_n
        re_data["UNIT_CODE_"] = "CIB" + "_" + city_c

        # "F"
        re_data["ADDR_"] = addr
        re_data["CITY_CODE_"] = city_c
        re_data["CITY_NAME_"] = city_n

        re_data["NAME_"] = name
        re_data["PROVINCE_CODE_"] = prov_c
        re_data["PROVINCE_NAME_"] = prov_n
        re_data["ENTITY_CODE_"] = data["ENTITY_CODE_"]
        re_data["ENTITY_NAME_"] = data["ENTITY_NAME_"]
        re_data["URL_"] = data["URL_"]
        re_data["TEL_"] = tel
        re_data["BUSINESS_HOURS_"] = time
        if "SOURCE_TYPE_NAME_" in data:
            re_data["SOURCE_TYPE_NAME_"] = data["SOURCE_TYPE_NAME_"]
            if re_data["SOURCE_TYPE_NAME_"] == "营业网点":
                re_data["TYPE_NAME_"] = "支行"
                re_data["TYPE_"] = "ZH"
            elif re_data["SOURCE_TYPE_NAME_"] == "社区银行":
                re_data["TYPE_NAME_"] = "支行"
                re_data["TYPE_"] = "ZH"
            elif re_data["SOURCE_TYPE_NAME_"] == "ATM":
                re_data["TYPE_NAME_"] = "自助银行"
                re_data["TYPE_"] = "ZZ"
        if not re_data.get("TYPE_NAME_", ""):
            if "机具类型" in data["CONTENT_"][:10]:
                re_data["TYPE_NAME_"] = "自助银行"
                re_data["TYPE_"] = "ZZ"
            elif "支行名称" in data["CONTENT_"][:10]:
                re_data["TYPE_NAME_"] = "支行"
                re_data["TYPE_"] = "ZH"
            elif "营业网点名称" in data["CONTENT_"][:10]:
                re_data["TYPE_NAME_"] = "支行"
                re_data["TYPE_"] = "ZH"

        data_list.append(re_data)

    # print(data_list)
    return data_list


def data_shuffle_1(data, province_list, city_list, area_list):
    data_list = list()
    re_data = dict()
    prov_n = ""
    prov_c = ""
    city_n = ""
    city_c = ""

    # 省市级信息
    if "北京" in data["CITY_NAME_"]:
        prov_n = "北京市"
        prov_c = "1100"
        city_n = "北京市"
        city_c = "110100"
    elif "天津" in data["CITY_NAME_"]:
        prov_n = "天津市"
        prov_c = "1200"
        city_n = "天津市"
        city_c = "120100"
    elif "上海" in data["CITY_NAME_"]:
        prov_n = "上海市"
        prov_c = "3100"
        city_n = "上海市"
        city_c = "310100"
    elif "重庆" in data["CITY_NAME_"]:
        prov_n = "重庆市"
        prov_c = "5000"
        city_n = "重庆市"
        city_c = "500100"
    else:
        for city in city_list:
            if city["NAME_"][:-1] in data["CITY_"]:
                city_n = city["NAME_"]
                city_c = city["CODE_"]
                prov_c = city["PARENT_"]
                break
        if prov_c:
            for prov in province_list:
                if prov["CODE_"] == prov_c:
                    prov_n = prov["NAME_"]
                    break

    first_shuffle = data["CONTENT_"].split("营业时间|")[1]
    second_shuffle = first_shuffle.split("|")

    if data["SOURCE_TYPE_NAME_"] == "ATM":
        shuffle_list = list()
        for s_index, second in enumerate(second_shuffle):
            if second in ["自动取款机", "存取款一体机"]:
                if second_shuffle[s_index+1] in ["自动取款机", "存取款一体机"]:
                    continue
                else:
                    name_ = re.findall(r"[\u4e00-\u9fa5]+", second_shuffle[s_index+1])[0] + second
                    addr_ = second_shuffle[s_index+1]
                    if re.findall(r"\d{3,}-\d+", second_shuffle[s_index+2]) or re.findall(r"\d{5,}", second_shuffle[s_index+2]):
                        tel_ = second_shuffle[s_index+2]
                        business_time = second_shuffle[s_index+3]
                    else:
                        tel_ = ""
                        business_time = second_shuffle[s_index+2]
                    shuffle_list.append({"NAME_": name_, "ADDR_": addr_, "TEL_": tel_, "BUSINESS_TIME_": business_time})

    # todo if some field is null
    elif data["SOURCE_TYPE_NAME_"] == "营业网点":
        shuffle_list = list()
        for s_index, second in enumerate(second_shuffle):
            if "兴业银行" in second:
                name_ = second
                addr_ = second_shuffle[s_index + 1]
                tel_ = second_shuffle[s_index + 2]
                business_time = second_shuffle[s_index + 3]
                shuffle_list.append({"NAME_": name_, "ADDR_": addr_, "TEL_": tel_, "BUSINESS_TIME_": business_time})

    # todo if some field is null
    # 社区银行
    else:
        shuffle_list = list()
        for s_index, second in enumerate(second_shuffle):
            if "兴业银行" in second:
                name_ = second
                addr_ = second_shuffle[s_index + 2]
                tel_ = second_shuffle[s_index + 3]
                business_time = second_shuffle[s_index + 4]
                shuffle_list.append({"NAME_": name_, "ADDR_": addr_, "TEL_": tel_, "BUSINESS_TIME_": business_time})

    for each in shuffle_list:
        # 地址清洗
        if prov_n in each["ADDR_"]:
            pass
        elif prov_n[:-1] in each["ADDR_"][:len(prov_n)]:
            each["ADDR_"] = each["ADDR_"][:len(prov_n)].replace(prov_n[:-1], prov_n) + each["ADDR_"][len(prov_n):]
        elif prov_n[:4] in each["ADDR_"][:len(prov_n)]:
            each["ADDR_"] = each["ADDR_"][:len(prov_n)].replace(prov_n[:4], prov_n) + each["ADDR_"][len(prov_n):]
        elif prov_n[:3] in each["ADDR_"][:len(prov_n)]:
            each["ADDR_"] = each["ADDR_"][:len(prov_n)].replace(prov_n[:3], prov_n) + each["ADDR_"][len(prov_n):]
        elif prov_n[:2] in each["ADDR_"][:len(prov_n)]:
            each["ADDR_"] = each["ADDR_"][:len(prov_n)].replace(prov_n[:2], prov_n) + each["ADDR_"][len(prov_n):]
        else:
            each["ADDR_"] = prov_n + each["ADDR_"]

        if city_n in each["ADDR_"][:len(prov_n) + len(city_n)]:
            each["ADDR_"] = each["ADDR_"]
        elif city_n[:-1] in each["ADDR_"][:len(prov_n) + len(city_n)]:
            each["ADDR_"] = each["ADDR_"][:len(prov_n) + len(city_n)].replace(
                city_n[:-1], city_n) + each["ADDR_"][len(prov_n) + len(city_n):]
        elif city_n[:4] in each["ADDR_"][:len(prov_n) + len(city_n)]:
            each["ADDR_"] = each["ADDR_"][:len(prov_n) + len(city_n)].replace(
                city_n[:4], city_n) + each["ADDR_"][len(prov_n) + len(city_n):]
        elif city_n[:3] in each["ADDR_"][:len(prov_n) + len(city_n)]:
            each["ADDR_"] = each["ADDR_"][:len(prov_n) + len(city_n)].replace(
                city_n[:3], city_n) + each["ADDR_"][len(prov_n) + len(city_n):]
        elif city_n[:2] in each["ADDR_"][:len(prov_n) + len(city_n)]:
            each["ADDR_"] = each["ADDR_"][:len(prov_n) + len(city_n)].replace(
                city_n[:2], city_n) + each["ADDR_"][len(prov_n) + len(city_n):]
        else:
            each["ADDR_"] = each["ADDR_"][:len(prov_n)] + city_n + each["ADDR_"][len(prov_n):]

        result = get_lat_lng(address=each["ADDR_"])
        try:
            re_data["LAT_"] = str(result["result"]["location"]["lat"])
            re_data["LNG_"] = str(result["result"]["location"]["lng"])
        except KeyError:
            re_data["LAT_"] = ""
            re_data["LNG_"] = ""
        else:
            dis_result = get_area(",".join([re_data["LAT_"], re_data["LNG_"]]))
            try:
                re_data["AREA_NAME_"] = dis_result["result"]["addressComponent"]["district"]
            except KeyError:
                re_data["AREA_NAME_"] = ""
            try:
                re_data["AREA_CODE_"] = dis_result["result"]["addressComponent"]["adcode"]
            except KeyError:
                re_data["AREA_CODE_"] = ""

        # # 添加分行编码
        # branch_code = None
        # for i in range(1, 10000):
        #     branch_code = "CIB" + "_" + area_c + "_" + "00000"
        #     branch_code = branch_code[:len(branch_code) - len(str(i))] + "{}".format(i)
        #     if branch_code in branch_code_list:
        #         continue
        #     else:
        #         branch_code_list.append(branch_code)
        #         break

        # "C"
        re_data["BANK_CODE_"] = "CIB"
        re_data["BANK_NAME_"] = data["ENTITY_NAME_"][:-3]
        re_data["SPIDER_TIME_"] = data["DATETIME_"]
        # re_data["AREA_CODE_"] = area_c
        # re_data["AREA_NAME_"] = area_n
        re_data["UNIT_CODE_"] = "CIB" + "_" + city_c

        # "F"
        re_data["ADDR_"] = each["ADDR_"]
        re_data["CITY_CODE_"] = city_c
        re_data["CITY_NAME_"] = city_n

        re_data["NAME_"] = each["NAME_"]
        re_data["PROVINCE_CODE_"] = prov_c
        re_data["PROVINCE_NAME_"] = prov_n
        re_data["ENTITY_CODE_"] = data["ENTITY_CODE_"]
        re_data["ENTITY_NAME_"] = data["ENTITY_NAME_"]
        re_data["URL_"] = data["URL_"]
        re_data["TEL_"] = each["TEL_"]
        re_data["BUSINESS_HOURS_"] = each["BUSINESS_TIME_"]
        if "SOURCE_TYPE_NAME_" in data:
            re_data["SOURCE_TYPE_NAME_"] = data["SOURCE_TYPE_NAME_"]
        if "机具类型" in data["CONTENT_"][:10]:
            re_data["TYPE_NAME_"] = "自助银行"
            re_data["TYPE_"] = "ZZ"
        elif "支行名称" in data["CONTENT_"][:10]:
            re_data["TYPE_NAME_"] = "支行"
            re_data["TYPE_"] = "ZH"
        elif "营业网点名称" in data["CONTENT_"][:10]:
            re_data["TYPE_NAME_"] = "支行"
            re_data["TYPE_"] = "ZH"

        data_list.append(re_data)

    # print(data_list)
    return data_list


if __name__ == '__main__':
    main_mongo = MongoClient(entity_code="CIBORGANIZE", mongo_collection="WD_TY")
    sc = GenericScript
    # Mysql connection
    sc.mysql_client, sc.mysql_connection = sc.mysql_connect()
    province_list, city_list, area_list, dir_area_list, bank_list = sc.data_from_mysql()
    data_list = main_mongo.main()
    for data in data_list:
        re_data = data_shuffle(data, province_list, city_list, area_list)
        # break
        # print(re_data)
